#+BEGIN_EXPORT html
---
layout: post
title: SICP Lecture 1B - Procedures and Processes; The Substitution Model
---

<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>
#+END_EXPORT

/This lecture covers mostly \S1.2 of the textbook./

** Designing procedures for iterative processes

The design of iterative processes requires identifying how to accumulate partial results combined
with an initialisation step to start the process.
This can be visualised as creating a table where each row is determined from the previous row(s), /e.g./

| Step | Result               |
|------+----------------------|
| $0$  | $x_0$                 |
| $1$  | $f\left( x_0 \right)$ |
| ...  | ...                  |

Applying this approach to the factorial it can be seen it is accumulating a series of products, /i.e./
\begin{equation}
  \begin{split}
    n! &= n \times \left( n - 1 \right) \times \ldots \times 1 \\
    &= \left( n \times \left( n - 1 \right) \right) \times \ldots \times 1
  \end{split}
\end{equation}
by storing the running product, no deferred operations are necessary, yielding an iterative process!
An example implementation is given below:
#+BEGIN_SRC scheme
  (define (fact n)
    (define (fact-iter product step)
      (if (> step n)
          product
          (fact-iter (* product step)
                     (+ step 1))))
    (fact-iter 1 1))
#+END_SRC

#+RESULTS:
: #<unspecified>

Note that compared to the recursive process which followed almost directly from the mathematical
definition, designing the procedure for an iterative process required additional consideration of
the problem.

